[
  {
    "name": "Colin Mcdonald",
    "img": "colin_mcdonald",
    "quote": "Dan and I trained together for several years and I cannot say enough good things about him.  I trained with him towards the end of my 13-year professional career and he understood exactly what was needed for me, to not only maintain great physical health, but continued to challenge me by getting me out of my comfort zone which allowed me to compete with the younger generation.  His ability to modify the workout regimen specific to my strengths and weaknesses in alignment with our goals is second to none.  The cookie cutter training program does not work for athletes at my level.  Dan is able to understand the specific needs and wants of each of his athletes, sets mutually agreed upon goals and expectations, and keeps us accountable on a daily basis. Dan is able to execute strength training, conditioning, skillwork, nutritional guidance, recovery, etc. at an elite level which is a MUST for professional athletes.  He earned 100% of my trust.   ",
    "accolades": [
      "Professional Games Played - 952 (159 NHL) ",
      "AHL All-Star Game",
      "AHL Most Goals (Willie Marshall Award) (42)",
      "AHL Player of the Week (Apr. 10)",
      "2011-2012",
      "AHL All-Star Game",
      "2015-2016",
      "AHL Player of the Week (Jan. 31)",
      "2018-2019",
      "AHL All-Star Game"
    ]
  },
  {
    "name": "Bobby Butler ",
    "img": "bobby_butler ",
    "quote": "Dan did an amazing job rebuilding the muscles and movements that I lost after taking off 2 years. He did a great job working with my schedule and pushing me when he knew I could handle it and taking it easy when my schedule didn't allow it. Without Dan I wouldn't have been able to get back to the high speed of the season. I would recommend anyone trying to play at the next level to work with him. ",
    "accolades": [
      "Professional Games Played 545 (133 NHL)",
      "Olympics 2018",
      "AHL All-Star Game",
      "AHL Calder Cup Champion",
      "AHL Playoffs Most Goals by Rookie (13)",
      "AHL Playoffs Most Points by Rookie (17)",
      "AHL Rookie of the Month (November)",
      "2012-2013",
      "AHL All-Star Game",
      "AHL Player of the Week (Dec. 16)",
      "World Championship Bronze Medal",
      "2014-2015",
      "AHL All-Star Game"
    ]
  },
  {
    "name": "Alex Vlasic ",
    "img": "alex_vlasic ",
    "quote": "During my time at BU, Dan had an enormous positive impact on my development. He always had my health and safety as a priority while still getting the most out of my physical capabilities. He was a big contributor to my success at BU and helped me get to where I’m at now.",
    "accolades": [
      "Hockey East All- Star ",
      "Signed entry level contract 3y/Deal with Chicago Blackhawk (March 15, 2022 )"
    ]
  },
  {
    "name": "TJ Walsh ",
    "img": "tj_walsh ",
    "quote": "I've been working with Dan for the past 6 years and he has helped me tons in developing my strength, mobility, conditioning, and recovery. I've had some serious injuries that Dan has helped me rehab from and got me back to playing. He's a top notch strength coach with extreme knowledge in strength training and injury prevention",
    "accolades": [
      "Hockey East All-Academic Team (2019-20, 2020-21) (NU)",
      "Pro Ambitions Hockey East Rookie of the Week (10/28/19) (NU)",
      "Won Bean Pot (Feb, 2020)",
      "First College Career Hat Trick (10/15/2022) (RPI) "
    ]
  },
  {
    "name": "Jack Quinlavan ",
    "img": "jack_quinlavan ",
    "quote": "Dan, maximizes every single one of his client’s potential in the weight room. My most dramatic summer improvements as an athlete came from working with Dan. Dan made me more powerful, explosive, and quicker. My only regret is not training with him throughout my whole career. He pushes you to limits as an athlete that are needed in order to succeed at the highest levels of your sport.",
    "accolades": [
      "3 Year Captain of University of Maine",
      "Signed First Pro Contract WIth Worcester Railers (8/24/2022)",
      "One Goal and 2 assists in his first 10 games,"
    ]
  },
  {
    "name": "Case Mccarthy",
    "img": "case_mccarthy",
    "quote": "Dan was a key part of our staff at BU.  He got us ready every week, translating off-ice training to on-ice performance.  He brought the energy every day, gaining the respect and building relationships with myself and the whole team.",
    "accolades": [
      "Current Assistant Captain of the #3 ranked Boston University Men’s Ice Hockey Team (2/1/2023)",
      "• Hockey East Defender of the Week (1/16/2023)",
      "• Hockey East Defender of the Month (November 2022)",
      "• Hockey East Defender of the Week (12/6/21) "
    ]
  },
  {
    "name": "Thomas Porrel ",
    "img": "thomas_porrel ",
    "quote": "For the past 5 years I have been training with Dan and it has been a huge part of my success and progress. He made sure I was ready for the season by working on the little extra things that help separate me and also improving my weakest areas physically. He has helped me rehab my shoulder after surgery and many other small issues/injuries. I would highly recommend Dan to any athlete at any level as he has helped get to where I am today.",
    "accolades": [
      "Four-star recruit in the class of 2022 according to Inside Lacrosse",
      "Inside Lacrosse’s No. 95 recruit overall in the class of 2022",
      "Selected as a Bostonlax All-American",
      "Named First Team All-Independent League",
      "Two-time team captain at Buckingham Browne & Nichols",
      "Also a four-year letterwinner in football ",
      "First Team All-ISL in football and First Team All-New England in football",
      "Dan has trained me for the past five years and it has changed my body and lifestyle. Dan is unbelievable at what he does and is very serious about his athletes. He always knows how to get the most effort out of any athlete he coaches. Not only is Dan a great trainer, but he is a great mentor and friend of mine. I recommend seeing Dan for any athlete who is serious about taking their performance to the next level. ",
      "Matt Ragen ",
      "High School: Four-star recruit by 247Sports and three-star by ESPN and Rivals",
      "Rated the No. 14 tight end in the class ",
      "No. 1 tight end in Massachusetts",
      "Starting tight end and captain at Lawrence Academy",
      "28 receptions for 556 yards and four touchdowns his senior season … ",
      "All-ISL and All-NEPSAC selections",
      "All-Scholastic honoree. "
    ]
  },
  {
    "name": "Chris Campbell ",
    "img": "chris_campbell ",
    "quote": "After working with Dan for a full  summer I can easily say it was the best thing I’ve done for my athletic career. Dan's focus and passion for his work made My workouts and rehabs are very easy to understand and execute. Walking into the gym everyday Dan had a plan for me and a great system in place where I as an athlete only had to worry about working hard. I never had to worry about if I was on the right plan because Dan tracked my progress over the entire summer and we saw significant progress. When I returned to school at the end of the summer I tested the best in the weight room in my career. Going into my 5th year of college I didn’t think I would see too many changes with my testing numbers but after a summer following and listening to Dan I took huge steps in the weightroom. Without Dan's training this past summer I don’t know where I would be as an athlete and it is safe to say that I would definitely work with Dan again in the future and recommend him to all other athletes looking to take their training to the next level.",
    "accolades": [
      "• All-NEC first team",
      "• NEC All-Tournament Team",
      "• NEC Spring Academic Honor Roll",
      "• NEC Prime Performer on Feb. 14 and Feb. 22",
      "• Started 14 games, collecting 31 ground balls and forcing 19 turnovers",
      "•America East All-Rookie Team (Hartford) "
    ]
  }
]